{"id": "sb001", "text": "I said I was wiped and he still booked a 10pm check-in, saying it was 'quick'.", "prev_turns": ["User: Today drained me, I need sleep.", "Assistant: Want me to help you reschedule anything?"], "sample_weight": 1.0}
{"id": "sb002", "text": "He kept inching closer on the couch after I scooted away twice.", "prev_turns": ["User: I like hanging out, just not cuddly tonight.", "Assistant: All good, how do you want to spend the evening?"], "sample_weight": 1.1}
{"id": "sb003", "text": "I told her I needed space and she replied with six heart emojis and a photo anyway.", "prev_turns": ["User: Please don't send pictures right now, I'm at work.", "Assistant: Want me to draft a gentle boundary?"], "sample_weight": 1.0}
{"id": "sb004", "text": "He joked that my 'no' sounded like a 'maybe' and tried again.", "prev_turns": ["User: I already declined the invite.", "Assistant: Should I help you phrase it more firmly?"], "sample_weight": 1.2}
{"id": "sb005", "text": "She kept pressing for my address after I said I'd meet in a public spot.", "prev_turns": ["User: First meet should be at the cafe, not my place.", "Assistant: Want a template reply?"], "sample_weight": 1.2}
{"id": "sb006", "text": "He ignored the silence on the call and said he'd swing by unless I objected.", "prev_turns": ["User: I'm not sure I want company tonight.", "Assistant: Do you want me to help you set a clear line?"], "sample_weight": 1.1}
{"id": "sb007", "text": "She said 'don't be boring' when I said I didn't want to drink more.", "prev_turns": ["User: I think I'm done for the night.", "Assistant: Maybe propose a wind-down instead?"], "sample_weight": 1.0}
{"id": "sb008", "text": "He offered a ride home but kept mentioning how late it was getting as if I owed him.", "prev_turns": ["User: I might leave soon, it's already midnight.", "Assistant: Safety first—want to call a car?"], "sample_weight": 1.0}
{"id": "sb009", "text": "They kept 'accidentally' brushing my arm after I moved seats.", "prev_turns": ["User: I'm feeling crowded at this table.", "Assistant: Do you want language to ask for space?"], "sample_weight": 1.1}
{"id": "sb010", "text": "He said if I trusted him I'd stay over, after I explained I was uncomfortable.", "prev_turns": ["User: Overnights are too much for me right now.", "Assistant: Want to restate that boundary?"], "sample_weight": 1.3}
{"id": "sb011", "text": "She kept calling me pet names after I asked her to use my name.", "prev_turns": ["User: Please just use my name, not 'baby'.", "Assistant: I can help you remind her gently."], "sample_weight": 0.9}
{"id": "sb012", "text": "He laughed off my 'please stop' and changed the subject instead of stopping.", "prev_turns": ["User: I told him that joke crossed a line.", "Assistant: Need a firmer follow-up?"], "sample_weight": 1.2}
